---
type: ViewDisplaySketchyLines
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ViewDisplaySketchyLines

`Autodesk.Revit.DB.ViewDisplaySketchyLines` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | EnableSketchyLines | 2015 | `public bool EnableSketchyLines { get ; set ; }` |
| Property | Extension | 2015 | `public int Extension { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Jitter | 2015 | `public int Jitter { get ; set ; }` |